app/Controllers/BkuBulanan.php

    public function cetakPdf($id = null)
    {
        // =======================================================================================
        // BAGIAN INI DIAMBIL DAN DISESUAIKAN DARI FUNGSI cetakExcel
        // =======================================================================================

        // LANGKAH 1: Tambahkan Array Konfigurasi
        // Peta untuk mendefinisikan hierarki kategori pengeluaran.
        $konfigurasiHierarki = [
            'OPERASIONAL PENGELOLAAN' => [
                'KESEKRETARIATAN',
                'PROMOSI'
            ],
            // Tambahkan induk lain jika ada di masa depan
        ];

        // LANGKAH 2: Ambil semua data yang dibutuhkan dari database
        $bkuModel = new BkuBulananModel();
        $detailPendapatanModel = new DetailPendapatanModel();
        $detailPengeluaranModel = new DetailPengeluaranModel();
        $masterKategoriModel = new MasterKategoriPengeluaranModel();
        $detailAlokasiModel = new DetailAlokasiModel();
        $pengaturanModel = new PengaturanModel();

        $laporan = $bkuModel->find($id);
        if (!$laporan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Laporan BKU tidak ditemukan.');
        }

        $rincianPendapatan = $detailPendapatanModel->select('detail_pendapatan.*, master_pendapatan.nama_pendapatan')->join('master_pendapatan', 'master_pendapatan.id = detail_pendapatan.master_pendapatan_id')->where('detail_pendapatan.bku_id', $id)->findAll();
        $rincianPengeluaran = $detailPengeluaranModel->select('detail_pengeluaran.*, master_kategori_pengeluaran.nama_kategori')->join('master_kategori_pengeluaran', 'master_kategori_pengeluaran.id = detail_pengeluaran.master_kategori_id')->where('detail_pengeluaran.bku_id', $id)->findAll();
        $rincianAlokasi = $detailAlokasiModel->select('detail_alokasi.*, master_kategori_pengeluaran.nama_kategori')->join('master_kategori_pengeluaran', 'master_kategori_pengeluaran.id = detail_alokasi.master_kategori_id')->where('detail_alokasi.bku_id', $id)->findAll();
        $masterKategori = $masterKategoriModel->findAll();

        $ketua = $pengaturanModel->where('meta_key', 'ketua_bumdes')->first()['meta_value'] ?? 'NAMA KETUA';
        $bendahara = $pengaturanModel->where('meta_key', 'bendahara_bumdes')->first()['meta_value'] ?? 'NAMA BENDAHARA';
        $lokasi = $pengaturanModel->where('meta_key', 'lokasi_laporan')->first()['meta_value'] ?? 'LOKASI';
---
SELECT *
FROM `bku_bulanan`
WHERE `bku_bulanan`.`id` = '17'
SELECT `detail_pendapatan`.*, `master_pendapatan`.`nama_pendapatan`
FROM `detail_pendapatan`
JOIN `master_pendapatan` ON `master_pendapatan`.`id` = `detail_pendapatan`.`master_pendapatan_id`
WHERE `detail_pendapatan`.`bku_id` = '17'
SELECT `detail_pengeluaran`.*, `master_kategori_pengeluaran`.`nama_kategori`
FROM `detail_pengeluaran`
JOIN `master_kategori_pengeluaran` ON `master_kategori_pengeluaran`.`id` = `detail_pengeluaran`.`master_kategori_id`
WHERE `detail_pengeluaran`.`bku_id` = '17'
SELECT `detail_alokasi`.*, `master_kategori_pengeluaran`.`nama_kategori`
FROM `detail_alokasi`
JOIN `master_kategori_pengeluaran` ON `master_kategori_pengeluaran`.`id` = `detail_alokasi`.`master_kategori_id`
WHERE `detail_alokasi`.`bku_id` = '17'
SELECT *
FROM `pengaturan`
WHERE `meta_key` = 'ketua_bumdes'
 LIMIT 1
SELECT *
FROM `pengaturan`
WHERE `meta_key` = 'bendahara_bumdes'
 LIMIT 1
SELECT *
FROM `pengaturan`
WHERE `meta_key` = 'lokasi_laporan'
 LIMIT 1

    public function new()
    {
        // Panggil model yang datanya dibutuhkan di form
        $masterPendapatanModel = new MasterPendapatanModel();
        $masterKategoriModel = new MasterKategoriPengeluaranModel();

        $data = [
            'title' => 'Buat Laporan BKU Bulanan Baru',
            'master_pendapatan' => $masterPendapatanModel->findAll(),
            'master_kategori' => $masterKategoriModel->findAll(),
---
SELECT *
FROM `master_pendapatan`
SELECT *
FROM `master_kategori_pengeluaran`

    public function getSaldoBulanLalu()
    {
        if ($this->request->isAJAX()) {
            $bulan = $this->request->getGet('bulan');
            $tahun = $this->request->getGet('tahun');

            $bulanSebelumnya = $bulan - 1;
            $tahunSebelumnya = $tahun;
            if ($bulanSebelumnya == 0) {
                $bulanSebelumnya = 12;
                $tahunSebelumnya = $tahun - 1;
            }

            $bkuModel = new BkuBulananModel();
            $laporanSebelumnya = $bkuModel->where('bulan', $bulanSebelumnya)
                ->where('tahun', $tahunSebelumnya)
                ->first();
---
SELECT *
FROM `bku_bulanan`
WHERE `bulan` = 5
AND `tahun` = '2025'
 LIMIT 1