app/Controllers/BkuBulanan.php

SELECT *
FROM `bku_bulanan`
ORDER BY `tahun` DESC, `bulan` DESC
---
    public function index()
    {
        // Panggil model
        $bkuModel = new BkuBulananModel();

        $data = [
            'title' => 'Daftar BKU Bulanan',
            // Ambil semua data, urutkan berdasarkan tahun dan bulan terbaru
            'laporan' => $bkuModel->orderBy('tahun', 'DESC')->orderBy('bulan', 'DESC')->findAll()
        ];

SELECT *
FROM `bku_bulanan`
WHERE `bku_bulanan`.`id` = '14'
SELECT `detail_pendapatan`.*, `master_pendapatan`.`nama_pendapatan`
FROM `detail_pendapatan`
JOIN `master_pendapatan` ON `master_pendapatan`.`id` = `detail_pendapatan`.`master_pendapatan_id`
WHERE `detail_pendapatan`.`bku_id` = '14'
SELECT `detail_alokasi`.*, `master_kategori_pengeluaran`.`nama_kategori`
FROM `detail_alokasi`
JOIN `master_kategori_pengeluaran` ON `master_kategori_pengeluaran`.`id` = `detail_alokasi`.`master_kategori_id`
WHERE `detail_alokasi`.`bku_id` = '14'
SELECT `detail_pengeluaran`.*, `master_kategori_pengeluaran`.`nama_kategori`
FROM `detail_pengeluaran`
JOIN `master_kategori_pengeluaran` ON `master_kategori_pengeluaran`.`id` = `detail_pengeluaran`.`master_kategori_id`
WHERE `detail_pengeluaran`.`bku_id` = '14'
---
    public function cetakPdf($id = null)
    {
        // 1. Ambil semua data yang dibutuhkan (termasuk data pengaturan)
        $bkuModel = new BkuBulananModel();
        $detailPendapatanModel = new DetailPendapatanModel();
        $detailPengeluaranModel = new DetailPengeluaranModel();
        $masterKategoriModel = new MasterKategoriPengeluaranModel();
        $detailAlokasiModel = new DetailAlokasiModel();
        $pengaturanModel = new PengaturanModel(); // Model baru

        $laporan = $bkuModel->find($id);
        if (!$laporan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Laporan BKU tidak ditemukan.');
        }

        // Ambil semua rincian data
        $rincianPendapatan = $detailPendapatanModel->select('detail_pendapatan.*, master_pendapatan.nama_pendapatan')->join('master_pendapatan', 'master_pendapatan.id = detail_pendapatan.master_pendapatan_id')->where('detail_pendapatan.bku_id', $id)->findAll();
        $rincianPengeluaran = $detailPengeluaranModel->select('detail_pengeluaran.*, master_kategori_pengeluaran.nama_kategori')->join('master_kategori_pengeluaran', 'master_kategori_pengeluaran.id = detail_pengeluaran.master_kategori_id')->where('detail_pengeluaran.bku_id', $id)->findAll();
        $rincianAlokasi = $detailAlokasiModel->select('detail_alokasi.*, master_kategori_pengeluaran.nama_kategori')->join('master_kategori_pengeluaran', 'master_kategori_pengeluaran.id = detail_alokasi.master_kategori_id')->where('detail_alokasi.bku_id', $id)->findAll();

SELECT *
FROM `bku_bulanan`
WHERE `bku_bulanan`.`id` = '14'
SELECT `detail_pendapatan`.*, `master_pendapatan`.`nama_pendapatan`
FROM `detail_pendapatan`
JOIN `master_pendapatan` ON `master_pendapatan`.`id` = `detail_pendapatan`.`master_pendapatan_id`
WHERE `detail_pendapatan`.`bku_id` = '14'
SELECT `detail_pengeluaran`.*, `master_kategori_pengeluaran`.`nama_kategori`
FROM `detail_pengeluaran`
JOIN `master_kategori_pengeluaran` ON `master_kategori_pengeluaran`.`id` = `detail_pengeluaran`.`master_kategori_id`
WHERE `detail_pengeluaran`.`bku_id` = '14'
SELECT `detail_pengeluaran`.*, `master_kategori_pengeluaran`.`nama_kategori`
FROM `detail_pengeluaran`
JOIN `master_kategori_pengeluaran` ON `master_kategori_pengeluaran`.`id` = `detail_pengeluaran`.`master_kategori_id`
WHERE `detail_pengeluaran`.`bku_id` = '17'
SELECT `detail_pendapatan`.*, `master_pendapatan`.`nama_pendapatan`
FROM `detail_pendapatan`
JOIN `master_pendapatan` ON `master_pendapatan`.`id` = `detail_pendapatan`.`master_pendapatan_id`
WHERE `detail_pendapatan`.`bku_id` = '17'
SELECT `detail_alokasi`.*, `master_kategori_pengeluaran`.`nama_kategori`
FROM `detail_alokasi`
JOIN `master_kategori_pengeluaran` ON `master_kategori_pengeluaran`.`id` = `detail_alokasi`.`master_kategori_id`
WHERE `detail_alokasi`.`bku_id` = '14'
---
    public function detail($id = null)
    {
        // Panggil semua model yang dibutuhkan
        $bkuModel = new BkuBulananModel();
        $detailPendapatanModel = new DetailPendapatanModel();
        $detailPengeluaranModel = new DetailPengeluaranModel();
        $detailAlokasiModel = new DetailAlokasiModel();

        $laporan = $bkuModel->find($id);
        if (!$laporan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Laporan BKU tidak ditemukan.');
        }

        // [PERBAIKAN] Hitung ulang total pendapatan untuk memastikan akurasi
        $laporan['total_pendapatan'] = (float)($laporan['saldo_bulan_lalu'] ?? 0) + (float)($laporan['penghasilan_bulan_ini'] ?? 0);

        $rincianPendapatan = $detailPendapatanModel
            ->select('detail_pendapatan.*, master_pendapatan.nama_pendapatan')
            ->join('master_pendapatan', 'master_pendapatan.id = detail_pendapatan.master_pendapatan_id')
            ->where('detail_pendapatan.bku_id', $id)->findAll();

        $rincianPengeluaran = $detailPengeluaranModel
            ->select('detail_pengeluaran.*, master_kategori_pengeluaran.nama_kategori')
            ->join('master_kategori_pengeluaran', 'master_kategori_pengeluaran.id = detail_pengeluaran.master_kategori_id')
            ->where('detail_pengeluaran.bku_id', $id)->findAll();

        $rincianAlokasi = $detailAlokasiModel
            ->select('detail_alokasi.*, master_kategori_pengeluaran.nama_kategori')
            ->join('master_kategori_pengeluaran', 'master_kategori_pengeluaran.id = detail_alokasi.master_kategori_id')
            ->where('detail_alokasi.bku_id', $id)
            ->findAll();