app/Controllers/BkuTahunan.php

SELECT DISTINCT `tahun`
FROM `bku_bulanan`
ORDER BY `tahun` DESC
---
    public function index()
    {
        $bkuModel = new BkuBulananModel();

        $data = [
            'title' => 'Laporan BKU Tahunan',
            'daftar_tahun' => $bkuModel->select('tahun')->distinct()->orderBy('tahun', 'DESC')->findAll()

SELECT *
FROM `bku_bulanan`
WHERE `tahun` = '2025'
ORDER BY `bulan` ASC
 LIMIT 1
SELECT SUM(`penghasilan_bulan_ini`) AS `penghasilan_bulan_ini`
FROM `bku_bulanan`
WHERE `tahun` = '2025'
 LIMIT 1
SELECT `mkp`.`nama_kategori`, SUM(dp.jumlah) as total_per_kategori
FROM `detail_pengeluaran` as `dp`
JOIN `bku_bulanan` as `bb` ON `bb`.`id` = `dp`.`bku_id`
JOIN `master_kategori_pengeluaran` as `mkp` ON `mkp`.`id` = `dp`.`master_kategori_id`
WHERE `bb`.`tahun` = '2025'
GROUP BY `dp`.`master_kategori_id`
---
    private function getLaporanTahunanData($tahun)
    {
        $bkuModel = new BkuBulananModel();
        $db = \Config\Database::connect();

        // 1. Ambil saldo awal tahun dari laporan bulan pertama di tahun tersebut
        $laporanBulanPertama = $bkuModel->where('tahun', $tahun)->orderBy('bulan', 'ASC')->first();
        $saldoAwalTahun = $laporanBulanPertama['saldo_bulan_lalu'] ?? 0;

        // 2. Jumlahkan HANYA 'penghasilan_bulan_ini' selama setahun
        $totalPenghasilanSetahun = $bkuModel->selectSum('penghasilan_bulan_ini')->where('tahun', $tahun)->first()['penghasilan_bulan_ini'] ?? 0;

        // 3. Total Pendapatan Tahunan yang valid
        $totalPendapatanTahunan = $saldoAwalTahun + $totalPenghasilanSetahun;

        // 4. Hitung total pengeluaran per kategori (logika ini sudah benar)
        $builder = $db->table('detail_pengeluaran as dp');
        $builder->select('mkp.nama_kategori, SUM(dp.jumlah) as total_per_kategori');
        $builder->join('bku_bulanan as bb', 'bb.id = dp.bku_id');
        $builder->join('master_kategori_pengeluaran as mkp', 'mkp.id = dp.master_kategori_id');
        $builder->where('bb.tahun', $tahun);
        $builder->groupBy('dp.master_kategori_id');
        $pengeluaranPerKategori = $builder->get()->getResultArray();