app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        // --- 1. Tentukan Rentang Waktu ---
        $tanggalMulai = $this->request->getGet('start_date') ?? date('Y-m-d', strtotime('-1 year'));
        $tanggalSelesai = $this->request->getGet('end_date') ?? date('Y-m-d');

        // --- 2. Siapkan Data untuk Grafik Pendapatan vs Pengeluaran ---
        $bkuModel = new BkuBulananModel();
        $laporanBulanan = $bkuModel
            ->where("STR_TO_DATE(CONCAT(tahun, '-', bulan, '-01'), '%Y-%m-%d') >=", $tanggalMulai)
            ->where("STR_TO_DATE(CONCAT(tahun, '-', bulan, '-01'), '%Y-%m-%d') <=", $tanggalSelesai)
            ->orderBy('tahun', 'ASC')->orderBy('bulan', 'ASC')
            ->findAll();
---
SELECT *
FROM `bku_bulanan`
WHERE STR_TO_DATE(CONCAT(tahun, '-', bulan, '-01'), '%Y-%m-%d') >= '2024-09-07'
AND STR_TO_DATE(CONCAT(tahun, '-', bulan, '-01'), '%Y-%m-%d') <= '2025-09-07'
ORDER BY `tahun` ASC, `bulan` ASC