app/Controllers/LabaRugi.php

SELECT DISTINCT `tahun`
FROM `bku_bulanan`
ORDER BY `tahun` DESC
---
    public function index()
    {
        $bkuModel = new BkuBulananModel();

        $data = [
            'title' => 'Laporan Laba Rugi',
            'daftar_tahun' => $bkuModel->select('tahun')->distinct()->orderBy('tahun', 'DESC')->findAll()