app/Controllers/NeracaKeuangan.php

SELECT DISTINCT `tahun`
FROM `bku_bulanan`
ORDER BY `tahun` DESC
SELECT *
FROM `bku_bulanan`
WHERE `tahun` = '2025'
ORDER BY `bulan` DESC
 LIMIT 1
SELECT *
FROM `master_neraca`
ORDER BY `kategori`, `id`
SELECT *
FROM `detail_neraca`
WHERE `tahun` = '2025'
---
    public function index()
    {
        $bkuModel = new BkuBulananModel();

        $data = [
            'title' => 'Laporan Neraca Keuangan',
            'daftar_tahun' => $bkuModel->select('tahun')->distinct()->orderBy('tahun', 'DESC')->findAll()
        ];

        $tahunDipilih = $this->request->getGet('tahun');

        if ($tahunDipilih) {
            $data['tahunDipilih'] = $tahunDipilih;

            // Ambil sisa saldo akhir dari BKU Tahunan untuk tahun yang dipilih
            $saldoAkhirTahun = $bkuModel->where('tahun', $tahunDipilih)->orderBy('bulan', 'DESC')->first()['saldo_akhir'] ?? 0;

            // Ambil semua komponen dari master
            $masterNeracaModel = new MasterNeracaModel();
            $semuaKomponen = $masterNeracaModel->orderBy('kategori, id')->findAll();

            // Ambil nilai yang sudah tersimpan untuk tahun ini (jika ada)
            $detailNeracaModel = new DetailNeracaModel();
            $nilaiTersimpan = $detailNeracaModel->where('tahun', $tahunDipilih)->findAll();