app/Controllers/Pengaturan.php

    public function index()
    {
        // Ambil setiap pengaturan dari database
        $data = [
            'title' => 'Pengaturan Laporan',
            'ketua_bumdes' => $this->pengaturanModel->where('meta_key', 'ketua_bumdes')->first()['meta_value'] ?? '',
            'bendahara_bumdes' => $this->pengaturanModel->where('meta_key', 'bendahara_bumdes')->first()['meta_value'] ?? '',
            'lokasi_laporan' => $this->pengaturanModel->where('meta_key', 'lokasi_laporan')->first()['meta_value'] ?? '',
---
SELECT *
FROM `pengaturan`
WHERE `meta_key` = 'ketua_bumdes'
 LIMIT 1
SELECT *
FROM `pengaturan`
WHERE `meta_key` = 'bendahara_bumdes'
 LIMIT 1
SELECT *
FROM `pengaturan`
WHERE `meta_key` = 'lokasi_laporan'
 LIMIT 1